Repository: berkayhuz/Validation
Catalog: Messages/ValidationResource.*.resx
Languages: da, de, es, fr, ja, no, ru, tr, zh

# Password_NumberRequired
source: Password must contain at least one number.
da: Adgangskoden skal indeholde mindst ét tal.
de: Das Passwort muss mindestens eine Zahl enthalten.
es: La contraseña debe contener al menos un número.
fr: Le mot de passe doit contenir au moins un chiffre.
ja: パスワードには少なくとも1つの数字が含まれている必要があります。
no: Passordet må inneholde minst ett tall.
ru: Пароль должен содержать хотя бы одну цифру.
tr: Parola en az bir sayı içermelidir.
zh: 密码必须包含至少一个数字。

# Password_SymbolRequired
source: Password must contain at least one symbol.
da: Adgangskoden skal indeholde mindst ét symbol.
de: Das Passwort muss mindestens ein Sonderzeichen enthalten.
es: La contraseña debe contener al menos un símbolo.
fr: Le mot de passe doit contenir au moins un symbole.
ja: パスワードには少なくとも1つの記号が含まれている必要があります。
no: Passordet må inneholde minst ett symbol.
ru: Пароль должен содержать хотя бы один символ.
tr: Parola en az bir sembol içermelidir.
zh: 密码必须包含至少一个符号。

# Password_UppercaseRequired
source: Password must contain at least one uppercase letter.
da: Adgangskoden skal indeholde mindst ét stort bogstav.
de: Das Passwort muss mindestens einen Großbuchstaben enthalten.
es: La contraseña debe contener al menos una letra mayúscula.
fr: Le mot de passe doit contenir au moins une lettre majuscule.
ja: パスワードには少なくとも1つの大文字が含まれている必要があります。
no: Passordet må inneholde minst én stor bokstav.
ru: Пароль должен содержать хотя бы одну заглавную букву.
tr: Parola en az bir büyük harf içermelidir.
zh: 密码必须包含至少一个大写字母。

# Password_Weak
source: Password must include upper/lowercase letters, numbers, special characters, and be at least {minLength} characters long.
da: Adgangskoden skal indeholde store/små bogstaver, tal, specialtegn og være mindst {minLength} tegn lang.
de: Das Passwort muss Groß- und Kleinbuchstaben, Zahlen, Sonderzeichen enthalten und mindestens {minLength} Zeichen lang sein.
es: La contraseña debe incluir letras mayúsculas/minúsculas, números, caracteres especiales y tener al menos {minLength} caracteres.
fr: Le mot de passe doit inclure des lettres majuscules/minuscules, des chiffres, des caractères spéciaux et contenir au moins {minLength} caractères.
ja: パスワードには、大文字・小文字・数字・特殊文字を含め、少なくとも{minLength}文字以上である必要があります。
no: Passordet må inneholde store og små bokstaver, tall, spesialtegn og være minst {minLength} tegn langt.
ru: Пароль должен содержать заглавные и строчные буквы, цифры, специальные символы и быть длиной не менее {minLength} символов.
tr: Parola büyük/küçük harf, sayı ve özel karakter içermeli ve en az {minLength} karakter uzunluğunda olmalıdır.
zh: 密码必须包含大写字母、小写字母、数字、特殊字符，并且长度不少于 {minLength} 个字符。

# Phone_Invalid
source: The phone number format is invalid.
da: Telefonnummerets format er ugyldigt.
de: Das Telefonnummernformat ist ungültig.
es: El formato del número de teléfono no es válido.
fr: Le format du numéro de téléphone est invalide.
ja: 電話番号の形式が無効です。
no: Telefonnummerets format er ugyldig.
ru: Неверный формат номера телефона.
tr: Telefon numarası biçimi geçersiz.
zh: 电话号码格式无效。

# Phone_TurkishMobile
source: Must be a valid Turkish mobile phone number.
da: Skal være et gyldigt tyrkisk mobilnummer.
de: Muss eine gültige türkische Mobiltelefonnummer sein.
es: Debe ser un número de móvil turco válido.
fr: Doit être un numéro de téléphone mobile turc valide.
ja: 有効なトルコの携帯電話番号である必要があります。
no: Må være et gyldig tyrkisk mobilnummer.
ru: Должен быть допустимый номер мобильного телефона Турции.
tr: Geçerli bir Türk cep telefonu numarası olmalıdır.
zh: 必须是有效的土耳其手机号码。

# PostalCode_Invalid
source: The postal code format is invalid.
da: Postnummerets format er ugyldigt.
de: Das Postleitzahlformat ist ungültig.
es: El formato del código postal no es válido.
fr: Le format du code postal est invalide.
ja: 郵便番号の形式が無効です。
no: Postnummerets format er ugyldig.
ru: Неверный формат почтового индекса.
tr: Posta kodu biçimi geçersiz.
zh: 邮政编码格式无效。

# Regex_Invalid
source: The value does not match the required format.
da: Værdien matcher ikke det krævede format.
de: Der Wert entspricht nicht dem erforderlichen Format.
es: El valor no coincide con el formato requerido.
fr: La valeur ne correspond pas au format requis.
ja: 値が必要な形式と一致していません。
no: Verdien samsvarer ikke med det påkrevde formatet.
ru: Значение не соответствует требуемому формату.
tr: Değer gerekli biçimle eşleşmiyor.
zh: 该值不符合所需格式。

# Security_Encrypted
source: Input must be in a valid encrypted format.
da: Input skal være i et gyldigt krypteret format.
de: Die Eingabe muss ein gültiges verschlüsseltes Format haben.
es: La entrada debe estar en un formato cifrado válido.
fr: La valeur doit être dans un format chiffré valide.
ja: 入力は有効な暗号化形式である必要があります。
no: Inndata må være i et gyldig kryptert format.
ru: Ввод должен быть в допустимом зашифрованном формате.
tr: Girdi geçerli bir şifrelenmiş biçimde olmalıdır.
zh: 输入必须是有效的加密格式。

# Security_InvalidFileName
source: File name must not contain invalid characters.
da: Filnavnet må ikke indeholde ugyldige tegn.
de: Der Dateiname darf keine ungültigen Zeichen enthalten.
es: El nombre del archivo no debe contener caracteres no válidos.
fr: Le nom du fichier ne doit pas contenir de caractères invalides.
ja: ファイル名に無効な文字を含めることはできません。
no: Filnavnet må ikke inneholde ugyldige tegn.
ru: Имя файла не должно содержать недопустимые символы.
tr: Dosya adı geçersiz karakterler içermemelidir.
zh: 文件名不能包含无效字符。

# Security_NoHtml
source: Text must not contain HTML tags.
da: Teksten må ikke indeholde HTML-tags.
de: Der Text darf keine HTML-Tags enthalten.
es: El texto no debe contener etiquetas HTML.
fr: Le texte ne doit pas contenir de balises HTML.
ja: テキストにHTMLタグを含めることはできません。
no: Teksten må ikke inneholde HTML-tagger.
ru: Текст не должен содержать HTML-теги.
tr: Metin HTML etiketleri içermemelidir.
zh: 文本不能包含HTML标签。

# Security_NoUnicodeSymbols
source: Text must not contain special Unicode symbols or emoji.
da: Teksten må ikke indeholde specielle Unicode-symboler eller emojis.
de: Der Text darf keine speziellen Unicode-Symbole oder Emojis enthalten.
es: El texto no debe contener símbolos Unicode especiales ni emojis.
fr: Le texte ne doit pas contenir de symboles Unicode spéciaux ni d’emojis.
ja: テキストに特殊なUnicode記号や絵文字を含めることはできません。
no: Teksten må ikke inneholde spesielle Unicode-symboler eller emoji.
ru: Текст не должен содержать специальные символы Unicode или эмодзи.
tr: Metin özel Unicode sembolleri veya emoji içermemelidir.
zh: 文本不能包含特殊的Unicode符号或表情符号。

# Security_PasswordComplexity
source: Password must be at least {0} characters long and contain a letter, number, and symbol.
da: Adgangskoden skal være mindst {0} tegn lang og indeholde et bogstav, et tal og et symbol.
de: Das Passwort muss mindestens {0} Zeichen lang sein und einen Buchstaben, eine Zahl und ein Sonderzeichen enthalten.
es: La contraseña debe tener al menos {0} caracteres e incluir una letra, un número y un símbolo.
fr: Le mot de passe doit comporter au moins {0} caractères, et contenir une lettre, un chiffre et un symbole.
ja: パスワードは少なくとも {0} 文字で、文字・数字・記号を含める必要があります。
no: Passordet må være minst {0} tegn langt og inneholde en bokstav, et tall og et symbol.
ru: Пароль должен содержать не менее {0} символов, включая букву, цифру и символ.
tr: Parola en az {0} karakter olmalı ve bir harf, bir sayı ve bir sembol içermelidir.
zh: 密码必须至少包含 {0} 个字符，并包含字母、数字和符号。

# Security_SqlInjectionSafe
source: Input must be safe against SQL injection.
da: Input skal være beskyttet mod SQL-injektion.
de: Die Eingabe muss gegen SQL-Injection abgesichert sein.
es: La entrada debe ser segura contra inyecciones SQL.
fr: La valeur doit être sécurisée contre les injections SQL.
ja: 入力はSQLインジェクションに対して安全でなければなりません。
no: Inndata må være trygg mot SQL-injeksjon.
ru: Ввод должен быть безопасным для SQL-инъекций.
tr: Girdi SQL enjeksiyonuna karşı güvenli olmalıdır.
zh: 输入必须防止SQL注入。

# Security_XssSafe
source: Input must not contain potential XSS content.
da: Input må ikke indeholde potentiel XSS-indhold.
de: Die Eingabe darf keinen potenziellen XSS-Inhalt enthalten.
es: La entrada no debe contener contenido XSS potencial.
fr: La valeur ne doit pas contenir de contenu potentiellement XSS.
ja: 入力に潜在的なXSSコンテンツを含めてはいけません。
no: Inndata må ikke inneholde potensiell XSS-kode.
ru: Ввод не должен содержать потенциально опасного XSS-контента.
tr: Girdi potansiyel XSS içeriği içermemelidir.
zh: 输入不得包含潜在的XSS内容。

# Slug_Invalid
source: The value must be a valid slug (lowercase letters, numbers, and dashes only).
da: Værdien skal være en gyldig slug (kun små bogstaver, tal og bindestreger).
de: Der Wert muss ein gültiger Slug sein (nur Kleinbuchstaben, Zahlen und Bindestriche).
es: El valor debe ser un slug válido (solo letras minúsculas, números y guiones).
fr: La valeur doit être un slug valide (lettres minuscules, chiffres et tirets uniquement).
ja: 値は有効なスラッグ形式である必要があります（小文字、数字、ハイフンのみ）。
no: Verdien må være en gyldig slug (kun små bokstaver, tall og bindestreker).
ru: Значение должно быть допустимым slug (только строчные буквы, цифры и дефисы).
tr: Değer geçerli bir slug olmalıdır (yalnızca küçük harf, rakam ve tire).
zh: 该值必须是有效的 slug（仅限小写字母、数字和短横线）。

# String_AlphaNumericOnly
source: Only letters and numbers are allowed.
da: Kun bogstaver og tal er tilladt.
de: Nur Buchstaben und Zahlen sind erlaubt.
es: Solo se permiten letras y números.
fr: Seules les lettres et les chiffres sont autorisés.
ja: 英字と数字のみ使用できます。
no: Kun bokstaver og tall er tillatt.
ru: Допускаются только буквы и цифры.
tr: Yalnızca harf ve rakamlara izin verilir.
zh: 只允许使用字母和数字。

# String_CamelCase
source: Text must be in camelCase format (e.g. exampleText).
da: Teksten skal være i camelCase-format (f.eks. exampleText).
de: Der Text muss im camelCase-Format sein (z. B. beispielText).
es: El texto debe estar en formato camelCase (p. ej., ejemploTexto).
fr: Le texte doit être au format camelCase (ex. : exempleTexte).
ja: テキストはキャメルケース形式（例: exampleText）である必要があります。
no: Teksten må være i camelCase-format (f.eks. eksempelTekst).
ru: Текст должен быть в формате camelCase (например: exampleText).
tr: Metin camelCase biçiminde olmalıdır (örneğin: exampleText).
zh: 文本必须为 camelCase 格式（例如：exampleText）。

# String_CountryCode
source: Must be a valid country code (ISO 3166-1 alpha-2).
da: Skal være en gyldig landekode (ISO 3166-1 alpha-2).
de: Muss ein gültiger Ländercode sein (ISO 3166-1 Alpha-2).
es: Debe ser un código de país válido (ISO 3166-1 alpha-2).
fr: Doit être un code de pays valide (ISO 3166-1 alpha-2).
ja: 有効な国コードである必要があります（ISO 3166-1 alpha-2）。
no: Må være en gyldig landskode (ISO 3166-1 alfa-2).
ru: Должен быть допустимый код страны (ISO 3166-1 alpha-2).
tr: Geçerli bir ülke kodu olmalıdır (ISO 3166-1 alpha-2).
zh: 必须是有效的国家代码（ISO 3166-1 alpha-2）。

# String_CurrencyCode
source: Must be a valid currency code (ISO 4217).
da: Skal være en gyldig valutakode (ISO 4217).
de: Muss ein gültiger Währungscode sein (ISO 4217).
es: Debe ser un código de moneda válido (ISO 4217).
fr: Doit être un code de devise valide (ISO 4217).
ja: 有効な通貨コードである必要があります（ISO 4217）。
no: Må være en gyldig valutakode (ISO 4217).
ru: Должен быть допустимый код валюты (ISO 4217).
tr: Geçerli bir para birimi kodu olmalıdır (ISO 4217).
zh: 必须是有效的货币代码（ISO 4217）。

# String_EndsWith
source: The value must end with the required suffix.
da: Værdien skal slutte med det krævede suffiks.
de: Der Wert muss mit dem erforderlichen Suffix enden.
es: El valor debe terminar con el sufijo requerido.
fr: La valeur doit se terminer par le suffixe requis.
ja: 値は指定されたサフィックスで終わる必要があります。
no: Verdien må slutte med det nødvendige suffikset.
ru: Значение должно заканчиваться на требуемый суффикс.
tr: Değer gerekli sonek ile bitmelidir.
zh: 该值必须以所需的后缀结尾。

# String_HexColor
source: Must be a valid hex color code (e.g. #FFF or #FFFFFF).
da: Skal være en gyldig hex-farvekode (f.eks. #FFF eller #FFFFFF).
de: Muss ein gültiger Hex-Farbcode sein (z. B. #FFF oder #FFFFFF).
es: Debe ser un código de color hexadecimal válido (p. ej., #FFF o #FFFFFF).
fr: Doit être un code couleur hexadécimal valide (ex. : #FFF ou #FFFFFF).
ja: 有効な16進カラーコードである必要があります（例: #FFF、#FFFFFF）。
no: Må være en gyldig hex-fargekode (f.eks. #FFF eller #FFFFFF).
ru: Должен быть допустимый шестнадцатеричный цветовой код (например: #FFF или #FFFFFF).
tr: Geçerli bir hex renk kodu olmalıdır (örneğin: #FFF veya #FFFFFF).
zh: 必须是有效的十六进制颜色代码（例如：#FFF 或 #FFFFFF）。

# String_Hostname
source: Must be a valid hostname.
da: Skal være et gyldigt værtsnavn.
de: Muss ein gültiger Hostname sein.
es: Debe ser un nombre de host válido.
fr: Doit être un nom d’hôte valide.
ja: 有効なホスト名である必要があります。
no: Må være et gyldig vertsnavn.
ru: Должно быть допустимое имя хоста.
tr: Geçerli bir ana bilgisayar adı olmalıdır.
zh: 必须是有效的主机名。

# String_JwtToken
source: Must be a valid JWT token.
da: Skal være et gyldigt JWT-token.
de: Muss ein gültiger JWT-Token sein.
es: Debe ser un token JWT válido.
fr: Doit être un jeton JWT valide.
ja: 有効なJWTトークンである必要があります。
no: Må være et gyldig JWT-token.
ru: Должен быть допустимый JWT-токен.
tr: Geçerli bir JWT belirteci olmalıdır.
zh: 必须是有效的JWT令牌。

# String_KebabCase
source: Text must be in kebab-case format (e.g. example-text).
da: Teksten skal være i kebab-case-format (f.eks. example-text).
de: Der Text muss im kebab-case-Format sein (z. B. beispiel-text).
es: El texto debe estar en formato kebab-case (p. ej., ejemplo-texto).
fr: Le texte doit être au format kebab-case (ex. : exemple-texte).
ja: テキストはケバブケース形式（例: example-text）である必要があります。
no: Teksten må være i kebab-case-format (f.eks. eksempel-tekst).
ru: Текст должен быть в формате kebab-case (например: example-text).
tr: Metin kebab-case biçiminde olmalıdır (örneğin: example-text).
zh: 文本必须为 kebab-case 格式（例如：example-text）。

# String_LanguageCode
source: Must be a valid language code (ISO 639-1).
da: Skal være en gyldig sprogkode (ISO 639-1).
de: Muss ein gültiger Sprachcode sein (ISO 639-1).
es: Debe ser un código de idioma válido (ISO 639-1).
fr: Doit être un code de langue valide (ISO 639-1).
ja: 有効な言語コードである必要があります（ISO 639-1）。
no: Må være en gyldig språkkode (ISO 639-1).
ru: Должен быть допустимый код языка (ISO 639-1).
tr: Geçerli bir dil kodu olmalıdır (ISO 639-1).
zh: 必须是有效的语言代码（ISO 639-1）。

# String_Lowercase
source: Text must be entirely lowercase.
da: Teksten skal udelukkende være med små bogstaver.
de: Der Text muss komplett in Kleinbuchstaben geschrieben sein.
es: El texto debe estar completamente en minúsculas.
fr: Le texte doit être entièrement en minuscules.
ja: テキストはすべて小文字である必要があります。
no: Teksten må være helt i små bokstaver.
ru: Текст должен быть полностью в нижнем регистре.
tr: Metin tamamen küçük harf olmalıdır.
zh: 文本必须全为小写。

# String_MacAddress
source: Must be a valid MAC address.
da: Skal være en gyldig MAC-adresse.
de: Muss eine gültige MAC-Adresse sein.
es: Debe ser una dirección MAC válida.
fr: Doit être une adresse MAC valide.
ja: 有効なMACアドレスである必要があります。
no: Må være en gyldig MAC-adresse.
ru: Должен быть допустимый MAC-адрес.
tr: Geçerli bir MAC adresi olmalıdır.
zh: 必须是有效的MAC地址。

# String_MimeType
source: Must be a valid MIME type (e.g. image/png).
da: Skal være en gyldig MIME-type (f.eks. image/png).
de: Muss ein gültiger MIME-Typ sein (z. B. image/png).
es: Debe ser un tipo MIME válido (p. ej., image/png).
fr: Doit être un type MIME valide (ex. : image/png).
ja: 有効なMIMEタイプである必要があります（例: image/png）。
no: Må være en gyldig MIME-type (f.eks. image/png).
ru: Должен быть допустимый MIME-тип (например: image/png).
tr: Geçerli bir MIME türü olmalıdır (örneğin: image/png).
zh: 必须是有效的MIME类型（例如：image/png）。

# String_NoSpecialCharacters
source: Must not contain special characters.
da: Må ikke indeholde specialtegn.
de: Darf keine Sonderzeichen enthalten.
es: No debe contener caracteres especiales.
fr: Ne doit pas contenir de caractères spéciaux.
ja: 特殊文字を含めてはいけません。
no: Må ikke inneholde spesialtegn.
ru: Не должно содержать специальных символов.
tr: Özel karakter içermemelidir.
zh: 不能包含特殊字符。

# String_NoWhitespace
source: The value must not contain any whitespace characters.
da: Værdien må ikke indeholde mellemrumstegn.
de: Der Wert darf keine Leerzeichen enthalten.
es: El valor no debe contener espacios en blanco.
fr: La valeur ne doit contenir aucun caractère d’espace.
ja: 値に空白文字を含めてはいけません。
no: Verdien må ikke inneholde mellomrom.
ru: Значение не должно содержать пробельных символов.
tr: Değer boşluk karakteri içermemelidir.
zh: 该值不能包含任何空白字符。

# String_OnlyLetters
source: This field must contain only letters.
da: Dette felt må kun indeholde bogstaver.
de: Dieses Feld darf nur Buchstaben enthalten.
es: Este campo solo debe contener letras.
fr: Ce champ ne doit contenir que des lettres.
ja: このフィールドには文字のみ含める必要があります。
no: Dette feltet må kun inneholde bokstaver.
ru: Это поле должно содержать только буквы.
tr: Bu alan yalnızca harf içermelidir.
zh: 此字段只能包含字母。

# String_OnlyLetters_Optional
source: If not empty, must contain only letters and spaces.
da: Hvis udfyldt, må det kun indeholde bogstaver og mellemrum.
de: Falls nicht leer, darf es nur Buchstaben und Leerzeichen enthalten.
es: Si no está vacío, debe contener solo letras y espacios.
fr: Si renseigné, ne doit contenir que des lettres et des espaces.
ja: 空でない場合、文字とスペースのみを含める必要があります。
no: Hvis ikke tomt, må det bare inneholde bokstaver og mellomrom.
ru: Если не пустое, должно содержать только буквы и пробелы.
tr: Boş değilse, yalnızca harf ve boşluk içermelidir.
zh: 如果不为空，则只能包含字母和空格。

# String_PascalCase
source: Text must be in PascalCase format (e.g. ExampleText).
da: Teksten skal være i PascalCase-format (f.eks. ExampleText).
de: Der Text muss im PascalCase-Format sein (z. B. BeispielText).
es: El texto debe estar en formato PascalCase (p. ej., EjemploTexto).
fr: Le texte doit être au format PascalCase (ex. : ExempleTexte).
ja: テキストはパスカルケース形式（例: ExampleText）である必要があります。
no: Teksten må være i PascalCase-format (f.eks. EksempelTekst).
ru: Текст должен быть в формате PascalCase (например: ExampleText).
tr: Metin PascalCase biçiminde olmalıdır (örneğin: ExampleText).
zh: 文本必须为 PascalCase 格式（例如：ExampleText）。

# String_SpecialCharRequired
source: The value must contain at least one special character.
da: Værdien skal indeholde mindst ét specialtegn.
de: Der Wert muss mindestens ein Sonderzeichen enthalten.
es: El valor debe contener al menos un carácter especial.
fr: La valeur doit contenir au moins un caractère spécial.
ja: 値には少なくとも1つの特殊文字を含める必要があります。
no: Verdien må inneholde minst ett spesialtegn.
ru: Значение должно содержать хотя бы один специальный символ.
tr: Değer en az bir özel karakter içermelidir.
zh: 该值必须包含至少一个特殊字符。

# String_StartsWith
source: The value must start with the required prefix.
da: Værdien skal starte med det krævede præfiks.
de: Der Wert muss mit dem erforderlichen Präfix beginnen.
es: El valor debe comenzar con el prefijo requerido.
fr: La valeur doit commencer par le préfixe requis.
ja: 値は指定されたプレフィックスで始まる必要があります。
no: Verdien må starte med det nødvendige prefikset.
ru: Значение должно начинаться с требуемого префикса.
tr: Değer gerekli önek ile başlamalıdır.
zh: 该值必须以所需的前缀开头。

# String_StartsWithUppercase
source: This field must start with an uppercase letter.
da: Dette felt skal starte med et stort bogstav.
de: Dieses Feld muss mit einem Großbuchstaben beginnen.
es: Este campo debe comenzar con una letra mayúscula.
fr: Ce champ doit commencer par une lettre majuscule.
ja: このフィールドは大文字で始まる必要があります。
no: Dette feltet må starte med en stor bokstav.
ru: Это поле должно начинаться с заглавной буквы.
tr: Bu alan büyük harf ile başlamalıdır.
zh: 此字段必须以大写字母开头。

# String_TrimmedEmpty
source: This field cannot be empty or whitespace.
da: Dette felt må ikke være tomt eller kun bestå af mellemrum.
de: Dieses Feld darf nicht leer oder nur aus Leerzeichen bestehen.
es: Este campo no puede estar vacío ni contener solo espacios.
fr: Ce champ ne peut pas être vide ou uniquement constitué d’espaces.
ja: このフィールドは空または空白のみであってはなりません。
no: Dette feltet kan ikke være tomt eller kun mellomrom.
ru: Это поле не может быть пустым или состоять только из пробелов.
tr: Bu alan boş veya yalnızca boşluk olamaz.
zh: 此字段不能为空或仅为空格。

# String_Uppercase
source: Text must be entirely uppercase.
da: Teksten skal udelukkende være med store bogstaver.
de: Der Text muss komplett in Großbuchstaben geschrieben sein.
es: El texto debe estar completamente en mayúsculas.
fr: Le texte doit être entièrement en majuscules.
ja: テキストはすべて大文字である必要があります。
no: Teksten må være helt i store bokstaver.
ru: Текст должен быть полностью в верхнем регистре.
tr: Metin tamamen büyük harf olmalıdır.
zh: 文本必须全为大写。

# String_Version
source: Must be a valid version format (e.g. 1.0.0).
da: Skal være et gyldigt versionsformat (f.eks. 1.0.0).
de: Muss ein gültiges Versionsformat sein (z. B. 1.0.0).
es: Debe tener un formato de versión válido (p. ej., 1.0.0).
fr: Doit être un format de version valide (ex. : 1.0.0).
ja: 有効なバージョン形式である必要があります（例: 1.0.0）。
no: Må være i gyldig versjonsformat (f.eks. 1.0.0).
ru: Должен быть допустимый формат версии (например: 1.0.0).
tr: Geçerli bir sürüm biçimi olmalıdır (örneğin: 1.0.0).
zh: 必须是有效的版本格式（例如：1.0.0）。

# Time_Range
source: Time must be between {0} and {1}.
da: Tiden skal være mellem {0} og {1}.
de: Die Zeit muss zwischen {0} und {1} liegen.
es: La hora debe estar entre {0} y {1}.
fr: L’heure doit être comprise entre {0} et {1}.
ja: 時間は {0} ～ {1} の間である必要があります。
no: Tidspunktet må være mellom {0} og {1}.
ru: Время должно быть между {0} и {1}.
tr: Süre {0} ile {1} arasında olmalıdır.
zh: 时间必须在 {0} 和 {1} 之间。

# Url_Instagram
source: Must be a valid Instagram URL.
da: Skal være en gyldig Instagram-URL.
de: Muss eine gültige Instagram-URL sein.
es: Debe ser una URL de Instagram válida.
fr: Doit être une URL Instagram valide.
ja: 有効なInstagramのURLである必要があります。
no: Må være en gyldig Instagram-nettadresse.
ru: Должен быть допустимый URL Instagram.
tr: Geçerli bir Instagram URL’si olmalıdır.
zh: 必须是有效的Instagram链接。

# Url_Invalid
source: The URL format is invalid. Only HTTP and HTTPS URLs are allowed.
da: URL-formatet er ugyldigt. Kun HTTP- og HTTPS-URLs er tilladt.
de: Das URL-Format ist ungültig. Nur HTTP- und HTTPS-URLs sind erlaubt.
es: El formato de la URL no es válido. Solo se permiten URLs HTTP y HTTPS.
fr: Le format de l’URL est invalide. Seules les URLs HTTP et HTTPS sont autorisées.
ja: URLの形式が無効です。HTTPまたはHTTPSのみ許可されます。
no: Nettadresseformatet er ugyldig. Kun HTTP- og HTTPS-adresser er tillatt.
ru: Неверный формат URL. Допускаются только HTTP и HTTPS.
tr: URL biçimi geçersiz. Yalnızca HTTP ve HTTPS URL’lerine izin verilir.
zh: URL格式无效。仅允许HTTP和HTTPS链接。

# Url_YouTube
source: Must be a valid YouTube URL.
da: Skal være en gyldig YouTube-URL.
de: Muss eine gültige YouTube-URL sein.
es: Debe ser una URL de YouTube válida.
fr: Doit être une URL YouTube valide.
ja: 有効なYouTubeのURLである必要があります。
no: Må være en gyldig YouTube-nettadresse.
ru: Должен быть допустимый URL YouTube.
tr: Geçerli bir YouTube URL’si olmalıdır.
zh: 必须是有效的YouTube链接。

# Xml_Invalid
source: The value is not a valid XML string.
da: Værdien er ikke en gyldig XML-streng.
de: Der Wert ist kein gültiger XML-String.
es: El valor no es una cadena XML válida.
fr: La valeur n’est pas une chaîne XML valide.
ja: 値は有効なXML文字列ではありません。
no: Verdien er ikke en gyldig XML-streng.
ru: Значение не является допустимой строкой XML.
tr: Değer geçerli bir XML metni değil.
zh: 该值不是有效的XML字符串。
