Repository: berkayhuz/Validation
Catalog: Messages/ValidationResource.*.resx
Languages: da, de, es, fr, ja, no, ru, tr, zh

# AccessToken_Invalid
source: The access token format is invalid.
da: Adgangstokenets format er ugyldigt.
de: Das Format des Zugriffstokens ist ungültig.
es: El formato del token de acceso no es válido.
fr: Le format du jeton d'accès est invalide.
ja: アクセストークンの形式が無効です。
no: Tilgangstokenets format er ugyldig.
ru: Неверный формат токена доступа.
tr: Erişim jetonunun biçimi geçersiz.
zh: 访问令牌格式无效。

# Base64_Invalid
source: The provided string is not a valid Base64-encoded value.
da: Den angivne streng er ikke en gyldig Base64-kodet værdi.
de: Der angegebene String ist kein gültiger Base64-kodierter Wert.
es: La cadena proporcionada no es un valor codificado en Base64 válido.
fr: La chaîne fournie n'est pas une valeur encodée en Base64 valide.
ja: 指定された文字列は有効なBase64エンコード値ではありません。
no: Den angitte strengen er ikke en gyldig Base64-kodet verdi.
ru: Указанная строка не является допустимым значением в формате Base64.
tr: Sağlanan metin geçerli bir Base64 kodlaması değil.
zh: 提供的字符串不是有效的Base64编码值。

# ConstantValue
source: This field must be equal to '{0}'.
da: Dette felt skal være lig med '{0}'.
de: Dieses Feld muss gleich '{0}' sein.
es: Este campo debe ser igual a '{0}'.
fr: Ce champ doit être égal à « {0} ».
ja: このフィールドは「{0}」である必要があります。
no: Dette feltet må være lik '{0}'.
ru: Это поле должно быть равно «{0}».
tr: Bu alan '{0}' değerine eşit olmalıdır.
zh: 此字段必须等于“{0}”。

# CreditCard_Invalid
source: The credit card number is invalid.
da: Kreditkortnummeret er ugyldigt.
de: Die Kreditkartennummer ist ungültig.
es: El número de tarjeta de crédito no es válido.
fr: Le numéro de carte bancaire est invalide.
ja: クレジットカード番号が無効です。
no: Kredittkortnummeret er ugyldig.
ru: Номер кредитной карты недействителен.
tr: Kredi kartı numarası geçersiz.
zh: 信用卡号码无效。

# Currency_Invalid
source: The currency code is invalid or unsupported.
da: Valutakoden er ugyldig eller ikke understøttet.
de: Der Währungscode ist ungültig oder wird nicht unterstützt.
es: El código de moneda no es válido o no es compatible.
fr: Le code de devise est invalide ou non pris en charge.
ja: 通貨コードが無効またはサポートされていません。
no: Valutakoden er ugyldig eller ikke støttet.
ru: Код валюты недействителен или не поддерживается.
tr: Para birimi kodu geçersiz veya desteklenmiyor.
zh: 货币代码无效或不受支持。

# DateRange_StartAfterEnd
source: Start date must be before or equal to end date.
da: Startdato skal være før eller lig med slutdato.
de: Das Startdatum muss vor oder gleich dem Enddatum liegen.
es: La fecha de inicio debe ser anterior o igual a la fecha de fin.
fr: La date de début doit être antérieure ou égale à la date de fin.
ja: 開始日は終了日以前である必要があります。
no: Startdato må være før eller lik sluttdato.
ru: Дата начала должна быть раньше или равна дате окончания.
tr: Başlangıç tarihi, bitiş tarihinden önce veya ona eşit olmalıdır.
zh: 开始日期必须早于或等于结束日期。

# Date_BusinessDay
source: Date must be a business day (Monday to Friday).
da: Datoen skal være en hverdag (mandag til fredag).
de: Das Datum muss ein Werktag sein (Montag bis Freitag).
es: La fecha debe ser un día laborable (de lunes a viernes).
fr: La date doit correspondre à un jour ouvrable (du lundi au vendredi).
ja: 日付は平日（月曜日～金曜日）である必要があります。
no: Datoen må være en virkedag (mandag til fredag).
ru: Дата должна приходиться на рабочий день (с понедельника по пятницу).
tr: Tarih iş günü olmalıdır (Pazartesi - Cuma arası).
zh: 日期必须是工作日（星期一至星期五）。

# Date_Future
source: Date must be in the future.
da: Datoen skal ligge i fremtiden.
de: Das Datum muss in der Zukunft liegen.
es: La fecha debe estar en el futuro.
fr: La date doit être dans le futur.
ja: 日付は未来である必要があります。
no: Datoen må være i fremtiden.
ru: Дата должна быть в будущем.
tr: Tarih gelecekte olmalıdır.
zh: 日期必须在将来。

# Date_InFuture
source: The date cannot be in the future.
da: Datoen må ikke ligge i fremtiden.
de: Das Datum darf nicht in der Zukunft liegen.
es: La fecha no puede estar en el futuro.
fr: La date ne peut pas être dans le futur.
ja: 日付は未来に設定できません。
no: Datoen kan ikke være i fremtiden.
ru: Дата не может быть в будущем.
tr: Tarih gelecekte olamaz.
zh: 日期不能在将来。

# Date_InPast
source: The date cannot be in the past.
da: Datoen må ikke ligge i fortiden.
de: Das Datum darf nicht in der Vergangenheit liegen.
es: La fecha no puede estar en el pasado.
fr: La date ne peut pas être dans le passé.
ja: 日付は過去に設定できません。
no: Datoen kan ikke være i fortiden.
ru: Дата не может быть в прошлом.
tr: Tarih geçmişte olamaz.
zh: 日期不能在过去。

# Date_LeapYear
source: Date must be in a leap year.
da: Datoen skal være i et skudår.
de: Das Datum muss in einem Schaltjahr liegen.
es: La fecha debe pertenecer a un año bisiesto.
fr: La date doit se situer dans une année bissextile.
ja: 日付はうるう年である必要があります。
no: Datoen må være i et skuddår.
ru: Дата должна приходиться на високосный год.
tr: Tarih artık bir yılda olmalıdır.
zh: 日期必须在闰年。

# Date_Only
source: Must be a date without time.
da: Skal være en dato uden klokkeslæt.
de: Muss ein Datum ohne Uhrzeit sein.
es: Debe ser una fecha sin hora.
fr: Doit être une date sans heure.
ja: 時間なしの日付である必要があります。
no: Må være en dato uten klokkeslett.
ru: Должна быть указана только дата без времени.
tr: Tarih, saat içermemelidir.
zh: 必须是无时间的日期。

# Date_Past
source: Date must be in the past.
da: Datoen skal ligge i fortiden.
de: Das Datum muss in der Vergangenheit liegen.
es: La fecha debe estar en el pasado.
fr: La date doit être dans le passé.
ja: 日付は過去である必要があります。
no: Datoen må være i fortiden.
ru: Дата должна быть в прошлом.
tr: Tarih geçmişte olmalıdır.
zh: 日期必须在过去。

# Date_Utc
source: Date must be marked as UTC.
da: Datoen skal være angivet som UTC.
de: Das Datum muss als UTC markiert sein.
es: La fecha debe estar marcada como UTC.
fr: La date doit être indiquée en UTC.
ja: 日付はUTCとしてマークされている必要があります。
no: Datoen må være angitt som UTC.
ru: Дата должна быть указана в формате UTC.
tr: Tarih UTC olarak işaretlenmiş olmalıdır.
zh: 日期必须标记为UTC。

# Date_Weekday
source: Date must be on a weekday (Monday to Friday).
da: Datoen skal være en hverdag (mandag til fredag).
de: Das Datum muss auf einen Wochentag fallen (Montag bis Freitag).
es: La fecha debe ser un día laborable (de lunes a viernes).
fr: La date doit tomber un jour de semaine (du lundi au vendredi).
ja: 日付は平日（月曜日～金曜日）である必要があります。
no: Datoen må være en ukedag (mandag til fredag).
ru: Дата должна приходиться на будний день (с понедельника по пятницу).
tr: Tarih hafta içi bir gün olmalıdır (Pazartesi - Cuma arası).
zh: 日期必须是工作日（星期一至星期五）。

# Date_Weekend
source: Date must be on a weekend (Saturday or Sunday).
da: Datoen skal være i en weekend (lørdag eller søndag).
de: Das Datum muss auf ein Wochenende fallen (Samstag oder Sonntag).
es: La fecha debe ser un fin de semana (sábado o domingo).
fr: La date doit tomber un week-end (samedi ou dimanche).
ja: 日付は週末（土曜日または日曜日）である必要があります。
no: Datoen må være i helgen (lørdag eller søndag).
ru: Дата должна приходиться на выходной день (суббота или воскресенье).
tr: Tarih hafta sonu bir gün olmalıdır (Cumartesi veya Pazar).
zh: 日期必须是周末（星期六或星期日）。

# Decimal_PrecisionExceeded
source: The number exceeds allowed precision or scale.
da: Tallet overskrider tilladt præcision eller skala.
de: Die Zahl überschreitet die erlaubte Genauigkeit oder Skalierung.
es: El número excede la precisión o escala permitida.
fr: Le nombre dépasse la précision ou l'échelle autorisée.
ja: 数値が許容される精度またはスケールを超えています。
no: Tallet overstiger tillatt presisjon eller skala.
ru: Число превышает допустимую точность или масштаб.
tr: Sayı izin verilen hassasiyet veya ölçeği aşıyor.
zh: 数字超过允许的精度或小数位数。

# Dev_AlwaysInvalid
source: Always invalid for test purposes.
da: Altid ugyldig – til testformål.
de: Immer ungültig für Testzwecke.
es: Siempre inválido para fines de prueba.
fr: Toujours invalide à des fins de test.
ja: テスト目的のため常に無効です。
no: Alltid ugyldig for testformål.
ru: Всегда недопустимо для целей тестирования.
tr: Test amaçlı olarak her zaman geçersiz.
zh: 始终无效，用于测试目的。

# Dev_AlwaysValid
source: Always valid.
da: Altid gyldig.
de: Immer gültig.
es: Siempre válido.
fr: Toujours valide.
ja: 常に有効です。
no: Alltid gyldig.
ru: Всегда допустимо.
tr: Her zaman geçerli.
zh: 始终有效。

# Email_Invalid
source: Invalid e-mail address.
da: Ugyldig e-mailadresse.
de: Ungültige E-Mail-Adresse.
es: Dirección de correo electrónico no válida.
fr: Adresse e-mail invalide.
ja: メールアドレスが無効です。
no: Ugyldig e-postadresse.
ru: Недопустимый адрес электронной почты.
tr: Geçersiz e-posta adresi.
zh: 电子邮件地址无效。

# Enum_Invalid
source: The selected value is not a valid option.
da: Den valgte værdi er ikke en gyldig mulighed.
de: Der ausgewählte Wert ist keine gültige Option.
es: El valor seleccionado no es una opción válida.
fr: La valeur sélectionnée n'est pas une option valide.
ja: 選択された値は有効なオプションではありません。
no: Den valgte verdien er ikke et gyldig alternativ.
ru: Выбранное значение недопустимо.
tr: Seçilen değer geçerli bir seçenek değil.
zh: 所选值不是有效选项。

# File_Invalid
source: Invalid file: size or format not allowed.
da: Ugyldig fil: størrelse eller format ikke tilladt.
de: Ungültige Datei: Größe oder Format nicht erlaubt.
es: Archivo no válido: tamaño o formato no permitido.
fr: Fichier invalide : taille ou format non autorisé.
ja: ファイルが無効です：サイズまたは形式が許可されていません。
no: Ugyldig fil: størrelse eller format er ikke tillatt.
ru: Недопустимый файл: размер или формат не поддерживаются.
tr: Geçersiz dosya: boyut veya biçim uygun değil.
zh: 无效文件：大小或格式不允许。

# Guid_Empty
source: {PropertyName} cannot be empty.
da: {PropertyName} må ikke være tom.
de: {PropertyName} darf nicht leer sein.
es: {PropertyName} no puede estar vacío.
fr: {PropertyName} ne peut pas être vide.
ja: {PropertyName} を空にすることはできません。
no: {PropertyName} kan ikke være tom.
ru: {PropertyName} не может быть пустым.
tr: {PropertyName} boş olamaz.
zh: {PropertyName}不能为空。

# Hex_Invalid
source: The value is not a valid hexadecimal string.
da: Værdien er ikke en gyldig hexadecimalt streng.
de: Der Wert ist kein gültiger Hexadezimal-String.
es: El valor no es una cadena hexadecimal válida.
fr: La valeur n'est pas une chaîne hexadécimale valide.
ja: 値は有効な16進文字列ではありません。
no: Verdien er ikke en gyldig heksadesimal streng.
ru: Значение не является допустимой шестнадцатеричной строкой.
tr: Değer geçerli bir onaltılık (hexadecimal) metin değil.
zh: 该值不是有效的十六进制字符串。

# IBAN_Invalid
source: The IBAN number is invalid.
da: IBAN-nummeret er ugyldigt.
de: Die IBAN-Nummer ist ungültig.
es: El número IBAN no es válido.
fr: Le numéro IBAN est invalide.
ja: IBAN番号が無効です。
no: IBAN-nummeret er ugyldig.
ru: Неверный номер IBAN.
tr: IBAN numarası geçersiz.
zh: IBAN号码无效。

# IpAddress_Invalid
source: The IP address format is invalid.
da: IP-adressens format er ugyldigt.
de: Das IP-Adressformat ist ungültig.
es: El formato de la dirección IP no es válido.
fr: Le format de l'adresse IP est invalide.
ja: IPアドレスの形式が無効です。
no: IP-adresseformatet er ugyldig.
ru: Недопустимый формат IP-адреса.
tr: IP adresi biçimi geçersiz.
zh: IP地址格式无效。

# Json_Invalid
source: The value is not a valid JSON string.
da: Værdien er ikke en gyldig JSON-streng.
de: Der Wert ist kein gültiger JSON-String.
es: El valor no es una cadena JSON válida.
fr: La valeur n'est pas une chaîne JSON valide.
ja: 値は有効なJSON文字列ではありません。
no: Verdien er ikke en gyldig JSON-streng.
ru: Значение не является допустимой строкой JSON.
tr: Değer geçerli bir JSON metni değil.
zh: 该值不是有效的JSON字符串。

# Localization_InvalidCulture
source: Must be a valid culture code (e.g. en-US).
da: Skal være en gyldig kultursprogkode (f.eks. en-US).
de: Muss ein gültiger Kulturcode sein (z. B. en-US).
es: Debe ser un código de cultura válido (por ejemplo, en-US).
fr: Doit être un code de culture valide (ex. : en-US).
ja: 有効なカルチャコード（例：en-US）である必要があります。
no: Må være en gyldig kulturkode (f.eks. en-US).
ru: Должен быть допустимый код культуры (например, en-US).
tr: Geçerli bir kültür kodu olmalıdır (örn. en-US).
zh: 必须是有效的区域性代码（例如：en-US）。

# Localization_InvalidLanguageTag
source: Must be a valid language tag (e.g. en-US, tr, fr-FR).
da: Skal være en gyldig sprogkode (f.eks. en-US, tr, fr-FR).
de: Muss ein gültiges Sprach-Tag sein (z. B. en-US, tr, fr-FR).
es: Debe ser una etiqueta de idioma válida (por ejemplo, en-US, tr, fr-FR).
fr: Doit être une étiquette de langue valide (ex. : en-US, tr, fr-FR).
ja: 有効な言語タグ（例：en-US、tr、fr-FR）である必要があります。
no: Må være en gyldig språkkode (f.eks. en-US, tr, fr-FR).
ru: Должен быть допустимый языковой тег (например, en-US, tr, fr-FR).
tr: Geçerli bir dil etiketi olmalıdır (örn. en-US, tr, fr-FR).
zh: 必须是有效的语言标签（例如：en-US、tr、fr-FR）。

# Localization_InvalidTimeZone
source: Must be a valid time zone ID.
da: Skal være et gyldigt tidszone-ID.
de: Muss eine gültige Zeitzonen-ID sein.
es: Debe ser un identificador de zona horaria válido.
fr: Doit être un identifiant de fuseau horaire valide.
ja: 有効なタイムゾーンIDである必要があります。
no: Må være en gyldig tidssone-ID.
ru: Должен быть допустимый идентификатор часового пояса.
tr: Geçerli bir zaman dilimi kimliği olmalıdır.
zh: 必须是有效的时区ID。

# Logic_CompareWithOther
source: This field must satisfy a comparison rule with another property.
da: Dette felt skal opfylde en sammenligningsregel med en anden egenskab.
de: Dieses Feld muss einer Vergleichsregel mit einer anderen Eigenschaft entsprechen.
es: Este campo debe cumplir una regla de comparación con otra propiedad.
fr: Ce champ doit respecter une règle de comparaison avec une autre propriété.
ja: このフィールドは他のプロパティとの比較ルールを満たす必要があります。
no: Dette feltet må oppfylle en sammenligningsregel med en annen egenskap.
ru: Это поле должно соответствовать правилу сравнения с другим свойством.
tr: Bu alan başka bir alanla karşılaştırma kuralına uymalıdır.
zh: 此字段必须与另一个属性进行比较。

# Logic_ConditionalRequired
source: This field is required when {0} is populated.
da: Dette felt er påkrævet, når {0} er udfyldt.
de: Dieses Feld ist erforderlich, wenn {0} ausgefüllt ist.
es: Este campo es obligatorio cuando {0} está relleno.
fr: Ce champ est requis lorsque {0} est renseigné.
ja: {0} が入力されている場合、このフィールドは必須です。
no: Dette feltet er påkrevd når {0} er angitt.
ru: Это поле обязательно, если заполнено {0}.
tr: {0} dolu olduğunda bu alan zorunludur.
zh: 当 {0} 已填写时，此字段为必填。

# Logic_ConditionalRequiredWithValue
source: This field is required when {0} is '{1}'.
da: Dette felt er påkrævet, når {0} er '{1}'.
de: Dieses Feld ist erforderlich, wenn {0} den Wert '{1}' hat.
es: Este campo es obligatorio cuando {0} es '{1}'.
fr: Ce champ est requis lorsque {0} vaut « {1} ».
ja: {0} が「{1}」の場合、このフィールドは必須です。
no: Dette feltet er påkrevd når {0} er '{1}'.
ru: Это поле обязательно, если {0} равно «{1}».
tr: {0} '{1}' değerine eşit olduğunda bu alan zorunludur.
zh: 当 {0} 为“{1}”时，此字段为必填。

# Logic_DisallowedIf
source: This field must be empty under certain conditions.
da: Dette felt skal være tomt under visse betingelser.
de: Dieses Feld muss unter bestimmten Bedingungen leer sein.
es: Este campo debe estar vacío en determinadas condiciones.
fr: Ce champ doit être vide dans certaines conditions.
ja: 特定の条件下ではこのフィールドを空にする必要があります。
no: Dette feltet må være tomt under visse betingelser.
ru: Это поле должно быть пустым при определённых условиях.
tr: Bu alan belirli koşullarda boş bırakılmalıdır.
zh: 在某些条件下，此字段必须为空。

# Logic_EqualToOtherProperty
source: This field must be equal to {0}.
da: Dette felt skal være lig med {0}.
de: Dieses Feld muss gleich {0} sein.
es: Este campo debe ser igual a {0}.
fr: Ce champ doit être égal à {0}.
ja: このフィールドは {0} と等しくなければなりません。
no: Dette feltet må være lik {0}.
ru: Это поле должно быть равно {0}.
tr: Bu alan {0} ile eşit olmalıdır.
zh: 此字段必须等于 {0}。

# Logic_MutuallyExclusiveProperties
source: Only one of the following fields must be set: {0}.
da: Kun ét af følgende felter må udfyldes: {0}.
de: Nur eines der folgenden Felder darf gesetzt sein: {0}.
es: Solo uno de los siguientes campos debe estar establecido: {0}.
fr: Un seul des champs suivants doit être renseigné : {0}.
ja: 次のフィールドのうち、1つだけを設定する必要があります: {0}。
no: Kun ett av følgende felt må være satt: {0}.
ru: Должно быть установлено только одно из следующих полей: {0}.
tr: Aşağıdaki alanlardan yalnızca biri ayarlanmalıdır: {0}.
zh: 以下字段中只能设置一个：{0}。

# Logic_NotEqualToOtherProperty
source: This field must not be equal to {0}.
da: Dette felt må ikke være lig med {0}.
de: Dieses Feld darf nicht gleich {0} sein.
es: Este campo no debe ser igual a {0}.
fr: Ce champ ne doit pas être égal à {0}.
ja: このフィールドは {0} と等しくない必要があります。
no: Dette feltet må ikke være lik {0}.
ru: Это поле не должно быть равно {0}.
tr: Bu alan {0} ile eşit olmamalıdır.
zh: 此字段不能等于 {0}。

# Logic_RequiredIf
source: This field is required under certain conditions.
da: Dette felt er påkrævet under visse betingelser.
de: Dieses Feld ist unter bestimmten Bedingungen erforderlich.
es: Este campo es obligatorio bajo ciertas condiciones.
fr: Ce champ est requis dans certaines conditions.
ja: 特定の条件下ではこのフィールドは必須です。
no: Dette feltet er påkrevd under visse betingelser.
ru: Это поле обязательно при определённых условиях.
tr: Bu alan belirli koşullarda zorunludur.
zh: 在特定条件下，此字段为必填。

# MustBeNull
source: This field must be null.
da: Dette felt skal være null.
de: Dieses Feld muss null sein.
es: Este campo debe ser nulo.
fr: Ce champ doit être nul.
ja: このフィールドは null でなければなりません。
no: Dette feltet må være null.
ru: Это поле должно быть null.
tr: Bu alan null olmalıdır.
zh: 此字段必须为空。

# MustNotBeNull
source: This field must not be null.
da: Dette felt må ikke være null.
de: Dieses Feld darf nicht null sein.
es: Este campo no debe ser nulo.
fr: Ce champ ne doit pas être nul.
ja: このフィールドは null であってはなりません。
no: Dette feltet må ikke være null.
ru: Это поле не должно быть null.
tr: Bu alan null olmamalıdır.
zh: 此字段不能为空。

# NationalId_Invalid
source: The national ID number is invalid.
da: Det nationale ID-nummer er ugyldigt.
de: Die nationale Identifikationsnummer ist ungültig.
es: El número de identificación nacional no es válido.
fr: Le numéro d'identification nationale est invalide.
ja: 国民ID番号が無効です。
no: Personnummeret er ugyldig.
ru: Неверный идентификационный номер.
tr: Ulusal kimlik numarası geçersiz.
zh: 国家身份证号码无效。

# Network_DomainName
source: Must be a valid domain name.
da: Skal være et gyldigt domænenavn.
de: Muss ein gültiger Domainname sein.
es: Debe ser un nombre de dominio válido.
fr: Doit être un nom de domaine valide.
ja: 有効なドメイン名である必要があります。
no: Må være et gyldig domenenavn.
ru: Должно быть допустимое доменное имя.
tr: Geçerli bir alan adı olmalıdır.
zh: 必须是有效的域名。

# Network_HostnameWithPort
source: Must be a valid hostname with port.
da: Skal være et gyldigt værtsnavn med port.
de: Muss ein gültiger Hostname mit Port sein.
es: Debe ser un nombre de host válido con puerto.
fr: Doit être un nom d'hôte valide avec un port.
ja: 有効なポート付きホスト名である必要があります。
no: Må være et gyldig vertsnavn med port.
ru: Должно быть допустимое имя хоста с портом.
tr: Geçerli bir ana bilgisayar adı ve bağlantı noktası olmalıdır.
zh: 必须是带端口的有效主机名。

# Network_IPv6Address
source: Must be a valid IPv6 address.
da: Skal være en gyldig IPv6-adresse.
de: Muss eine gültige IPv6-Adresse sein.
es: Debe ser una dirección IPv6 válida.
fr: Doit être une adresse IPv6 valide.
ja: 有効なIPv6アドレスである必要があります。
no: Må være en gyldig IPv6-adresse.
ru: Должен быть допустимый IPv6-адрес.
tr: Geçerli bir IPv6 adresi olmalıdır.
zh: 必须是有效的IPv6地址。

# Number_DivisibleBy
source: Value must be divisible by {0}.
da: Værdien skal være delelig med {0}.
de: Der Wert muss durch {0} teilbar sein.
es: El valor debe ser divisible por {0}.
fr: La valeur doit être divisible par {0}.
ja: 値は {0} で割り切れる必要があります。
no: Verdien må være delelig med {0}.
ru: Значение должно делиться на {0} без остатка.
tr: Değer {0} sayısına tam bölünebilmelidir.
zh: 值必须能被 {0} 整除。

# Number_Even
source: Number must be even.
da: Nummeret skal være lige.
de: Die Zahl muss gerade sein.
es: El número debe ser par.
fr: Le nombre doit être pair.
ja: 数値は偶数である必要があります。
no: Tallet må være et partall.
ru: Число должно быть чётным.
tr: Sayı çift olmalıdır.
zh: 数字必须是偶数。

# Number_MaxDigits
source: Number must have at most {0} digits.
da: Nummeret må højst have {0} cifre.
de: Die Zahl darf höchstens {0} Ziffern enthalten.
es: El número debe tener como máximo {0} dígitos.
fr: Le nombre doit comporter au maximum {0} chiffres.
ja: 数字は最大で {0} 桁までである必要があります。
no: Tallet kan ha maksimalt {0} sifre.
ru: Число должно содержать не более {0} цифр.
tr: Sayı en fazla {0} basamaklı olmalıdır.
zh: 数字最多不能超过 {0} 位数。

# Number_MinDigits
source: Number must have at least {0} digits.
da: Nummeret skal have mindst {0} cifre.
de: Die Zahl muss mindestens {0} Ziffern enthalten.
es: El número debe tener al menos {0} dígitos.
fr: Le nombre doit comporter au moins {0} chiffres.
ja: 数字は少なくとも {0} 桁である必要があります。
no: Tallet må ha minst {0} sifre.
ru: Число должно содержать не менее {0} цифр.
tr: Sayı en az {0} basamaklı olmalıdır.
zh: 数字最少必须有 {0} 位数。

# Number_MultipleOf
source: Number must be a multiple of {0}.
da: Nummeret skal være et multiplum af {0}.
de: Die Zahl muss ein Vielfaches von {0} sein.
es: El número debe ser múltiplo de {0}.
fr: Le nombre doit être un multiple de {0}.
ja: 数値は {0} の倍数である必要があります。
no: Tallet må være et multiplum av {0}.
ru: Число должно быть кратно {0}.
tr: Sayı {0} sayısının katı olmalıdır.
zh: 数字必须是 {0} 的倍数。

# Number_NotZero
source: Value must not be zero.
da: Værdien må ikke være nul.
de: Der Wert darf nicht null sein.
es: El valor no debe ser cero.
fr: La valeur ne doit pas être zéro.
ja: 値はゼロであってはなりません。
no: Verdien må ikke være null.
ru: Значение не должно быть нулём.
tr: Değer sıfır olmamalıdır.
zh: 值不能为零。

# Number_Odd
source: Number must be odd.
da: Nummeret skal være ulige.
de: Die Zahl muss ungerade sein.
es: El número debe ser impar.
fr: Le nombre doit être impair.
ja: 数値は奇数である必要があります。
no: Tallet må være et oddetall.
ru: Число должно быть нечётным.
tr: Sayı tek olmalıdır.
zh: 数字必须是奇数。

# Number_PercentageRange
source: Value must be a percentage between 0 and 100.
da: Værdien skal være en procent mellem 0 og 100.
de: Der Wert muss ein Prozentsatz zwischen 0 und 100 sein.
es: El valor debe ser un porcentaje entre 0 y 100.
fr: La valeur doit être un pourcentage compris entre 0 et 100.
ja: 値は0〜100のパーセンテージである必要があります。
no: Verdien må være en prosentverdi mellom 0 og 100.
ru: Значение должно быть процентом от 0 до 100.
tr: Değer yüzde olarak 0 ile 100 arasında olmalıdır.
zh: 值必须是0到100之间的百分比。

# Number_PowerOfTwo
source: Number must be a power of two.
da: Nummeret skal være en potens af to.
de: Die Zahl muss eine Zweierpotenz sein.
es: El número debe ser una potencia de dos.
fr: Le nombre doit être une puissance de deux.
ja: 数値は2の累乗である必要があります。
no: Tallet må være en tofaktor (2^n).
ru: Число должно быть степенью двойки.
tr: Sayı iki tabanında bir kuvvet olmalıdır.
zh: 数字必须是2的幂。

# Number_Prime
source: Number must be a prime.
da: Nummeret skal være et primtal.
de: Die Zahl muss eine Primzahl sein.
es: El número debe ser primo.
fr: Le nombre doit être un nombre premier.
ja: 数値は素数である必要があります。
no: Tallet må være et primtall.
ru: Число должно быть простым.
tr: Sayı asal sayı olmalıdır.
zh: 数字必须是质数。

# Pagination_PageNumber
source: Page number must be ≥ 1.
da: Sidetallet skal være ≥ 1.
de: Die Seitennummer muss ≥ 1 sein.
es: El número de página debe ser ≥ 1.
fr: Le numéro de page doit être ≥ 1.
ja: ページ番号は1以上である必要があります。
no: Sidetallet må være ≥ 1.
ru: Номер страницы должен быть ≥ 1.
tr: Sayfa numarası ≥ 1 olmalıdır.
zh: 页码必须大于或等于 1。

# Pagination_PageSize
source: Page size must be between 1 and 100.
da: Sidestørrelsen skal være mellem 1 og 100.
de: Die Seitengröße muss zwischen 1 und 100 liegen.
es: El tamaño de página debe estar entre 1 y 100.
fr: La taille de page doit être comprise entre 1 et 100.
ja: ページサイズは1から100の間でなければなりません。
no: Sidestørrelsen må være mellom 1 og 100.
ru: Размер страницы должен быть от 1 до 100.
tr: Sayfa boyutu 1 ile 100 arasında olmalıdır.
zh: 每页大小必须在 1 到 100 之间。
